app/Controllers/AdminController.php

SELECT *
FROM `produk`
SELECT *
FROM `log`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['produk'] = $this->produkModel->findAll();

        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        if(session()->get('role') !== 'Admin'){
            return redirect()->to('/')->with('error', 'Halaman tidak ditemukan');
        }

        $db = \Config\Database::connect();
        $data['log'] = $db->table('log')->orderBy('created_at', 'DESC')->get()->getResultArray();

SELECT *
FROM `produk`
---
    public function produk()
    {
        if(session()->get('role') !== 'Admin'){
            return redirect()->to('/')->with('error', 'Halaman tidak ditemukan');
        }
        $data['produk'] = $this->produkModel->findAll();